<!DOCTYPE html>
<html><head>
<meta http-equiv="content-type" content="text/html; charset=UTF-8"><title>W3.CSS Template</title>
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" href="css/w3.css">
<link rel="stylesheet" href="css/w3-theme-black.css">
<link rel="stylesheet" href="css/font-awesome.css">
<script src="js/w3data.js"></script>
<style>
html,body,h1,h2,h3,h4,h5,h6 {font-family: "Roboto", sans-serif}
.w3-sidenav a,.w3-sidenav h4 {padding: 12px;}
.w3-bar a {
    padding-top: 12px;
    padding-bottom: 12px;
}
</style>
</head><body>
<div w3-include-html="nav.html"></div>

<!-- Overlay effect when opening sidenav on small screens -->
<div class="w3-overlay w3-hide-large" onclick="w3_close()" style="cursor:pointer" title="close side menu" id="myOverlay"></div>

<!-- Main: shift it to the right by 250 pixels when the sidenav is visible -->
<div class="w3-main" style="margin-left:250px">
<div class="w3-row w3-padding-64">
<div class="w3-col w3-container">

<!-- Begin content -->

<h2 class="w3-text-teal">Kanal Men&uuml;</h2>

<p>F&uuml;r jeden Kanal gibt es einen eigenes Men&uuml; um die Ladefunktionen des Kanals
zu konfigurieren und zu steuern.</p>

<h3 class="w3-text-teal">Konfigurieren</h3> 
<h4 class="w3-text-teal">Neu</h4>

<p>Mit diesem Men&uuml;punkt k&ouml;nnen Sie die Kan&auml;le konfigurieren. Die
Konfigurationen einzelner Kan&auml;le k&ouml;nnen in Kanalkonfigurationsdateien
verwaltet werden.</p>

<p>F&uuml;r die Konfiguration der Kan&auml;le &ouml;ffnet sich ein eigenes
Dialogfenster. Hier k&ouml;nnen folgende Konfigurationsparameter eingegeben werden:</p>

<ul class="w3-ul">
<li>Akkutyp</li>
<li>Zellenzahl</li>
<li>Nennspannung</li>
<li>Nennkapazit&auml;t</li>
<li>Ladestrom</li>
<li>Entladestrom</li>
<li>Beschreibung</li>
</ul>

<p>Für die weitere Verarbeitung der Konfiguration stehen folgende Schaltfl&auml;chen
zur Verf&uuml;gung:</p>

<h4 class="w3-text-teal">Laden</h4>

<p>Die Kanalkonfiguration wird zur&uuml;ckgesetzt.</p>

<h4 class="w3-text-teal">Laden</h4>

<p>Eine Kanalkonfiguration wird aus einer vorhandenen Kanalkonfigurationsdatei
geladen.</p>

<h4 class="w3-text-teal">Pr&uuml;fen</h4>

<p>Die aktuell eingestellten Werte der Kanalkonfiguration werden gepr&uuml;ft. Erst
wenn die Pr&uuml;fung erfolgreich verlaufen ist, wird die Schaltfl&auml;che
<em>Programmieren</em> frei geschaltet.</p>

<p>Es finden folgende Plausibilit&auml;tspr&uuml;fungen und Korrekturen statt:</p>

<ul class="w3-ul">
<li>Der Ladestrom dar nicht gr&ouml;&szlig;er als die doppelte Nennkapazit&auml;t sein. Dies wird automatisch korrigiert.</li>
<li>Wenn die Akkuspannung h&ouml;her als 20% der Nennspannung der eingestellten Anzahl Zellen ist, dann wird die Anzahl der Zellen angepasst.</li>
<li>Der Lade- bzw. Entladestrom wird bei Kanal 1 und 2 auf je 3.5 A begrenzt.</li>
<li>Der Lade- bzw. Entladestrom wird bei Kanal 3 und 4 auf je 1 A begrenzt.</li>
</ul>


<h4 class="w3-text-teal">Speichern</h4>

<p>Die aktuelle Kanalkonfiguration wird in einer Datei gespeichert. Diese
Schaltfläche ist nur frei geschaltet, wenn die Kanalkonfiguration gepr&uuml;ft wurde.</p>

<h4 class="w3-text-teal">Programmieren</h4>

<p>Die aktuelle Kanalkonfiguration wird im ALC 7000 Expert eingestellt. Diese
Schaltfl&auml;che ist nur frei geschaltet, wenn die Kanalkonfiguration gepr&uuml;ft
wurde.</p>

<h4 class="w3-text-teal">Ende</h4>

<p>Beendet das Dialogfenster f&uuml;r die Kanalkonfiguration.</p>


<h3 class="w3-text-teal">Starten</h3>

<p>Die aktuell eingestellte Ladefunktion wird auf dem ALC 7000 Expert gestartet.</p>

<h3 class="w3-text-teal">Beenden</h3>

<p>Die auf dem ALC 7000 aktive Ladefunktion wird beendet.</p>

<h3 class="w3-text-teal">Checkboxen zur Auswahl der Ladefunktion</h3>

<p>Die gew&uuml;nschte Ladefunktion kann mit den Check-Boxen ausgew&auml;hlt
werden. Diese Auswahl ist nur m&ouml;glich, wenn keine Ladefunktion aktiv ist.</p>

<h3 class="w3-text-teal">Messwerte</h3>

<p>Die Messwerte werden tabellarisch oder als Grafik in einem eigenen Dialogfenster
angezeigt. Dieses Fester kann ge&ouml;ffnet bleiben. Die Anzeigen werden
regelm&auml;&szlig;ig aktualisiert. Eine Grafikanzeige erfolgt nur dann wenn mindestens
4 Messwerte vorliegen und das Programm <em>GNUPLOT</em> installiert ist.</p>

<!-- End content -->

</div>
</div>
  <footer id="myFooter">
    <div class="w3-container w3-theme-l1">
      <p>Powered by <a href="https://www.w3schools.com/w3css/default.asp" target="_blank">w3.css</a></p>
    </div>
  </footer>


<!-- END MAIN -->
</div>
<script>
w3IncludeHTML();
</script>

</body></html>
